{"assertion": "English: Can you please bring me a glass of water?\nTurkish: Bana bir bardak su getirebilir misin?\nWord = bring", "journalism": "English: She studied journalism in college.\n\nTurkish: Üniversitede gazetecilik üzerine eğitim aldı.", "temporarily": "English: Can you use the word \"temporarily\" in a sentence?\nTurkish: \"Geçici olarak\" kelimesini bir cümlede kullanabilir misiniz?", "carve": "English: I will carve a pumpkin for Halloween.\nTurkish: Cadılar Bayramı için bir balkabağı oymak istiyorum.\nword = carve", "meditation": "English: I need to practice meditation every day to improve my focus and reduce stress.\nTurkish: Odaklanmamı geliştirmek ve stresi azaltmak için her gün meditasyon yapmam gerekiyor.\nWord: meditation", "legislative": "English: The legislative branch of government is responsible for making laws.\nTurkish: Yasama organı, yasaları yapma sorumluluğuna sahiptir.\nKelime: legislative", "mobilize": "English: My cousin will mobilize the community to clean up the park.\nTurkish: Kuzenim, parkı temizlemek için toplumu mobilize edecek. \nword = clean up", "compassion": "Word: compassion\nEnglish Sentence: She showed great compassion towards the homeless man.\nTurkish Translation: O, evsiz adama karşı büyük bir şefkat gösterdi.", "genetic": "English: The field of genetics has made significant advancements in recent years.\nTurkish: Genetik alanı son yıllarda önemli ilerlemeler kaydetmiştir.\nWord: genetics", "2": "English: I love going to the beach.\nTurkish: Plajda vakit geçmeyi seviyorum.\nWord = beach", "C": "English: Can I have a glass of water, please?\nTurkish: Bir bardak su alabilir miyim, lütfen?\nWord = water", "plead": "Sentence: I plead guilty in court.\n\nTurkish Translation: Mahkemede suçlu olduğuma dair itiraz ediyorum.", "spam": "English: The cat is sleeping on the bed.\nTurkish: Kedi yatakta uyuyor.\nWord = bed", "succession": "English: The succession of events led to a major change in the company.\n\nTurkish: Olayların ardışık sıralaması şirkette büyük bir değişime yol açtı.\nWord = succession", "vice": "English: The vice president spoke at the conference.\nTurkish: Başkan yardımcısı konferansta konuştu.\nWord: vice", "marketplace": "English: I love to go to the marketplace to buy fresh fruits and vegetables.\n\nTurkish: Taze meyve ve sebze almak için pazara gitmeyi çok seviyorum.\n\nWord: marketplace", "cease": "Word: cease\nEnglish Sentence: The neighbors agreed to cease their noisy parties after numerous complaints.\nTurkish Translation: Komşular, birçok şikayetten sonra gürültülü partilerine son vermeyi kabul ettiler.", "restraint": "English: She showed great restraint in not reacting to his rude comments.\nTurkish: O, onun kaba yorumlarına tepki vermemekte büyük bir öz kontrol gösterdi.\nKelime: öz kontrol", "oversee": "English: The teacher will oversee the students during the exam.\n\nTurkish: Sınav sırasında öğretmen öğrencileri denetleyecek.\n\nWord: oversee", "allegedly": "Word = allegedly\n\nEnglish sentence: He was allegedly involved in the crime.\nTurkish translation: İddiaya göre suça karıştı.", "consequently": "English: The weather forecast predicts rain for tomorrow.\nTurkish: Hava tahmini yarın için yağış öngörüyor.\nWord: forecast", "alignment": "English: The alignment of the stars is a beautiful sight to see at night.\n\nTurkish: Gece gökyüzündeki yıldızların hizalanması görülmeye değer bir güzelliktir.\n\nWord = alignment", "stir": "English: I love to stir the soup while it's cooking.\n\nTurkish: Çorbayı pişirirken karıştırmayı severim.\nKelime = stir", "manipulate": "English: Can you manipulate this image for me?\nTurkish: Bu resmi benim için manipüle edebilir misin?\nWord: manipulate", "dilemma": "English: The word \"dilemma\" refers to a difficult situation in which one has to make a choice between equally undesirable options.\nTurkish: \"Dilemma\" kelimesi, eşit derecede istenmeyen seçenekler arasında bir seçim yapılması gereken zor bir durumu ifade eder.", "stark": "English: The bird is flying in the sky.\nTurkish: Kuş gökyüzünde uçuyor.\nWord = flying", "heritage": "English: My heritage is a combination of Turkish and Italian.\n\nTurkish: Mirasım Türk ve İtalyan kültürlerinin bir karışımıdır.\n\nNext word: journey", "clip": "English: I need a paper clip to hold these papers together.\nTurkish: Bu kağıtları bir arada tutmak için bir ataç gerekli.", "violate": "English: He violated the rules of the game by cheating.\n\nTurkish: Bir oyunun kurallarını hile yaparak ihlal etti.\nWord: violate", "pond": "English: The word I give you is \"apple\".\n\nTurkish: Bana verdiğin kelime \"elma\".", "commodity": "English: The commodity market is booming with various products for consumers.\nTurkish: Tüketici için çeşitli ürünlerle dolu olan emtia piyasası hızla büyüyor.\nWord: commodity", "niche": "English: Can you please write a sentence using the word \"delicious\"?\n\nTurkish: \"Lütfen, 'leziz' kelimesini kullanarak bir cümle yazabilir misiniz?\"", "lens": "English: I need a new lens for my camera.\nTurkish: Kameram için yeni bir lens'e ihtiyacım var.", "trillion": "English: The national debt of my country is measured in trillions of dollars.\nTurkish: Ülkemin ulusal borcu trilyonlarca dolar olarak ölçülüyor.\nKelime: debt", "sake": "English: The dog is chasing its tail.\nTurkish: Köpek kuyruğunu kovalıyor.\nWord: dog", "merger": "English: The merger of two companies resulted in a stronger market presence.\n\nTurkish: İki şirketin birleşmesi, daha güçlü bir pazara sahip olmalarına neden oldu.", "syndrome": "English: He has a rare medical condition called Marfan syndrome.\nTurkish: Onda Marfan sendromu adında nadir bir tıbbi durum var.\nWord: syndrome", "blade": "English: The chef carefully cut the tomatoes with a sharp blade.\n\nTurkish: Şef, keskin bir bıçakla domatesleri dikkatlice kesti.\nWord = blade", "aggression": "English: He showed aggression towards his opponent during the match.\n\nTurkish: Maç sırasında rakibi karşısında saldırganlık gösterdi.", "bound": "English: I am bound by my promise.\nTurkish: Vaadime bağlıyım.\nKelime = bound", "optimistic": "English: Sarah is an optimistic person who always sees the glass half full.\n\nTurkish: Sarah her zaman bardağın yarısı dolu olan iyimser bir kişidir.\n\nWord: optimistic", "notify": "English: Could you please notify me when the package arrives?\n\nTurkish: Paket geldiğinde beni bilgilendirebilir misin?\n\nWord = notify", "elevate": "English: The elevator is out of order.\nTurkish: Asansör arızalı.", "chop": "Sentence: She decided to chop the vegetables for the salad.\n\nTurkish translation: Salata için sebzeleri doğramaya karar verdi.\n\nWord: chop", "coastal": "English: I love spending my vacations at coastal areas.\n\nTurkish: Tatillerimi sahil bölgelerinde geçirmeyi seviyorum.\n\nWord: coastal", "recruitment": "English: The company is actively seeking new recruits for their sales team.\nTurkish: Şirket, satış ekibi için aktif olarak yeni personel arıyor.\nWord: recruitment", "nest": "English: \"I love to travel to different countries and experience new cultures.\"\n\nTurkish: \"Farklı ülkelere seyahat etmeyi ve yeni kültürler deneyimlemeyi çok seviyorum.\"\n\nWord: travel", "tribal": "English: I am fascinated by tribal cultures and their ancient traditions.\n\nTurkish: Ben, kabile kültürleri ve onların eski gelenekleri tarafından büyüleniyorum.\n\nWord: fascinated (büyülenmiş)", "spokesman": "English: The spokesman delivered a speech at the press conference.\nTurkish: Sözcü, basın toplantısında bir konuşma yaptı.\nWord: spokesman", "neighboring": "English: My neighboring house is very loud.\n\nTurkish: Komşu evim çok gürültülü.", "basement": "English: The storage room is located in the basement of the building.\nTurkish: Depo odası bina bodrum katında bulunmaktadır.\nWord: basement", "nickel": "English: I found a nickel on the floor.\nTurkish: Yerde bir nikel buldum.\nWord = floor", "slogan": "English: The cat is playing with a ball.\n\nTürkish: Kedi top ile oynuyor.\nKelime: oynamak", "debris": "English: After the earthquake, there was a lot of debris on the streets.\nTurkish: Depremden sonra sokaklarda çok fazla enkaz vardı.\nWord = debris", "stance": "English: I love to travel to different countries.\nTurkish: Farklı ülkelere seyahat etmeyi seviyorum.\nKelime = travel", "toss": "English: \"I usually toss a coin to make decisions.\"\n\nTurkish: \"Genellikle karar vermek için bir parayı havaya atarım.\"", "mentor": "English: My mentor has been guiding me throughout my career.\n\nTurkish: Kariyerim boyunca mentorum beni yönlendirdi.", "explicit": "English: Can you please give me the definition of the word \"explicit\"?\nTurkish: \"Explicit\" kelimesinin tanımını bana verebilir misiniz?\nword: definition", "exclusively": "English: I like to wear clothes that are exclusively designed. \nTürkish: Sadece özel olarak tasarlanmış kıyafetleri giymeyi severim. \nWord = exclusively", "convenience": "English: I need to find a convenience store to buy some snacks.\nTurkish: Bazı atıştırmalıklar satın almak için bir bakkal bulmam lazım.\nWord: convenience", "circuit": "English: I enjoy solving puzzles, it's like exercising my brain.\n\nTurkish: Bulmacalar çözmekten keyif alıyorum, beyin egzersizi yapmak gibidir.\n\nWord: enjoy", "sacrifice": "English: \"My friend made a sacrifice by giving up his dream job to take care of his sick mother.\"\n\nTurkish: \"Arkadaşım, hasta annesine bakmak için hayalindeki işi bırakarak bir fedakarlık yaptı.\"\n\nWord = sacrifice", "patent": "English: I received a patent for my invention.\nTurkish: Ben icadım için bir patent aldım.", "wolf": "English: The wolf howled at the moon.\nTurkish: Kurt, ay'a uludu. \nWord: howl", "hunger": "English: I have a word for you: \"hunger\"\n\nTurkish: Sana bir kelime vereceğim: \"açlık\"", "interface": "English: The cat is sleeping on the mat.\nTurkish: Kedi, minderin üzerinde uyuyor.\nWord = sleeping", "ally": "English: Can you help me with this assignment?\nTurkish: Bu ödevde bana yardımcı olabilir misin?\nword = assignment", "hilarious": "English: The clown's performance was hilarious.\n\nTurkish: Palyaçonun gösterisi çok komikti.", "blend": "English: I love to blend different fruits to make a delicious smoothie.\nTurkish: Lezzetli bir smoothie yapmak için farklı meyveleri karıştırmayı severim.\nWord: blend", "concede": "English: She conceded defeat after a long, hard-fought battle.\nTurkish: Uzun ve zorlu bir mücadeleden sonra yenilgiyi kabul etti.\nWord: concede", "leap": "English: He made a big leap in his career.\nTurkish: Kariyerinde büyük bir sıçrama yaptı.\nWord = leap", "lawn": "English: The children are playing in the lawn.\nTurkish: Çocuklar çimlerde oynuyor.\nWord: lawn", "diagnosis": "English: Can you please give me the diagnosis for my health condition?\nTurkish: Sağlık durumum için teşhis verebilir misiniz?\nWord: diagnosis", "bay": "English: The bay was calm and peaceful.\nTurkish: Koy sakin ve huzurluydu.", "1": "English: \"I love to travel.\"\n\nTurkish: \"Ben seyahat etmeyi çok seviyorum.\"\n\nWord = travel (seyahat)", "remainder": "English: I am learning Turkish and practicing with a language assistant.\n\nTurkish: Türkçe öğreniyorum ve bir dil asistanıyla pratik yapıyorum.\n\nWord: assistant", "allowance": "English: I'd like to ask for a pay raise as my monthly allowance is not enough.\n\nTurkish: Aylık harçlığım yeterli olmadığı için zam istemek istiyorum.\n\nWord: raise", "gesture": "English: Can you show me a gesture of peace?\nTurkish: Bana bir barış jesti gösterebilir misin?\nWord = gesture", "incidence": "English: The incident happened last night.\nTurkish: Olay dün gece gerçekleşti.\nWord = incident", "spark": "English: The spark ignited the fire, lighting up the dark room.\n\nTurkish:  Kıvılcım, karanlık odada ışığı yakarak ateşi tutuşturdu.", "disagreement": "English: The twins always have a disagreement about which TV channel to watch.\nTurkish: İkizler her zaman hangi televizyon kanalını izleyecekleri konusunda anlaşmazlık yaşarlar. \nWord = disagreement", "sanction": "English: The government imposed economic sanctions on the country due to its nuclear program.\n\nTurkish: Hükümet, nükleer programı nedeniyle ülkeye ekonomik yaptırımlar uyguladı.\n\nWord: economic", "naked": "English: I felt naked without my jacket in the cold weather.\nTurkish: Soğuk havalarda ceketsiz hissettim.", "intent": "Word: intention\nEnglish: My intention is to travel the world and learn about different cultures.\nTurkish: Amacım dünyayı gezip farklı kültürleri öğrenmektir.", "atrocity": "English: The journalist reported on the atrocities committed during the war.\nTurkish: Gazeteci savaş sırasında işlenen vahşetleri raporladı.\nWord: atrocity", "wisdom": "English: The cat is sleeping on the couch.\nTurkish: Kedi koltukta uyuyor.\nWord: cat", "s": "English: The sun is shining brightly.\n\nTurkish: Güneş parlak bir şekilde parlıyor.\nword= sun", "vulnerable": "English: She felt vulnerable walking alone at night.\nTurkish: Gece yalnız yürürken kendini savunmasız hissetti.\nWord: vulnerable", "contrary": "English: The weather forecast said it would rain today, but it turned out to be sunny instead.\nTurkish: Hava tahminine göre bugün yağmur yağacaktı, fakat yerine güneşli çıktı.\nWord: forecast", "damaging": "English: The storm caused damaging effects on the houses in the neighborhood.\nTurkish: Fırtına, mahalledeki evlere zarar verici etkiler yarattı.\nWord = damaging", "ultimate": "English: \"I love to travel and explore new places.\"\n\nTurkish: \"Seyahat etmeyi ve yeni yerler keşfetmeyi çok seviyorum.\"\n\nWord: travel", "installation": "English: The installation process of this software is quite simple.\nTurkish: Bu yazılımın kurulum süreci oldukça basittir.\nWord: installation", "abolish": "English: The government wants to abolish the old law.\nTurkish: Hükümet, eski kanunu ortadan kaldırmak istiyor.\nWord: abolish", "tribute": "English: Can you give me a hand with this project?\nTurkish: Bu projede bana yardım edebilir misin?\nWord = hand", "terminal": "English: I enjoy reading books.\nTurkish: Kitap okumaktan keyif alıyorum.\nWord = enjoy", "fit": "English: The dress I bought yesterday doesn't fit me.\n\nTurkish: Dün satın aldığım elbise bana uymuyor.\nKelime = fit", "drain": "English: The sink is clogged, so I need to call a plumber to unclog the drain.\nTurkish: Lavabo tıkandı, bu yüzden lavabo giderini açmak için bir tesisatçıya çağırman gerekiyor.\nWord: drain", "mechanical": "English: I need to fix my mechanical watch.\nTurkish: Mekanik saatimi tamir etmem gerekiyor.\nKelime: mechanical", "instrumental": "English: The piano is the instrument I love playing the most.\nTurkish: En çok çalmaktan keyif aldığım enstrüman piyanodur.", "costly": "English: The diamond necklace was very costly.\nTurkish: Elmas kolye çok pahalıydı.\nWord: necklace", "expire": "English: The milk will expire tomorrow.\nTurkish: Süt yarın son kullanma tarihini geçecek.", "complement": "English: The cat is sleeping peacefully.\nTurkish: Kedi huzurlu bir şekilde uyuyor.\nWord = peacefully", "embarrassment": "English: I felt a deep sense of embarrassment when I tripped and fell in front of everyone.\n\nTurkish: Herkesin önünde tökezleyip düştüğümde derin bir utanma hissi hissettim.\n\nWord = embarrassment", "certainty": "English: The teacher spoke with certainty about the subject.\nTurkish: Öğretmen konu hakkında kesinlikle konuştu.\nWord: certainty", "processor": "English: My friend has a powerful processor in his computer.\n\nTurkish: Arkadaşımın bilgisayarında güçlü bir işlemci var.\nWord: processor", "circulation": "English: The circulation of blood is essential for body function.\n\nTurkish: Kan dolaşımı, vücut fonksiyonu için önemlidir.\n\nWord: circulation", "trait": "English: The trait that defines her the most is her kindness.\n\nTurkish: Onu en çok tanımlayan özellik iyilikseverliğidir.\n\nWord: trait", "intriguing": "Turkish: Sana bir kelime vereceğim.\nEnglish: I will give you a word.", "lesbian": "English: I love to read books.\n\nTurkish: Ben kitap okumayı çok seviyorum.\nKelime = kitap", "dissolve": "English: Her smile can dissolve even the toughest hearts.\n\nTurkish: O güler yüzü, en zor kalpleri bile eritebilir.\n\nWord: dissolve", "essence": "English: The essence of life is to be happy.\n\nTurkish: Hayatın özü mutlu olmaktır.", "net": "English: \"I love to travel to new places and explore different cultures.\"\n\nTurkish: \"Yeni yerlere seyahat etmeyi ve farklı kültürleri keşfetmeyi seviyorum.\"\n\nWord: explore", "terrorist": "English: The government is taking strong measures to combat terrorism.\n\nTurkish: Hükümet terörizmle mücadele etmek için güçlü önlemler alıyor.\nWord: terrorism", "faction": "English: The faction has gained control over the government.\n\nTurkish: Fraksiyon hükümet üzerinde kontrol kazandı.", "observer": "English: The observer carefully watched the colorful sunset over the ocean. \nTurkish: Gözlemci, okyanusun üzerindeki renkli günbatımını dikkatlice izledi.\nWord = observer.", "embassy": "English: I need to go to the embassy to apply for a visa.\nTurkish: Vize için başvuruda bulunmak için büyükelçiliğe gitmeliyim.\nWord: embassy", "harvest": "English: The farmer was busy harvesting crops in the field.\nTurkish: Çiftçi tarlada mahsul hasadıyla meşguldü.\nWord: harvest", "clarity": "English: I need clarity on this matter.\nTurkish: Bu konuda açıklık istiyorum.\nWord = clarity", "radiation": "English: Radiation can be harmful if not properly controlled. \nTurkish: Radyasyon, düzgün bir şekilde kontrol edilmezse zararlı olabilir. \nKelime = radyasyon", "wholly": "English: I am wholly dedicated to my work.\nTurkish: Çalışmama tamamen adanmışım.\nWord: wholly", "Â©": "English: apple\n\nTurkish: elmaya kadar o kadar uzundu ki düştü.", "screw": "English: I couldn't unscrew the lid of the jar.\nTurkish: Kavanozun kapağını çıkaramadım.\nWord: unscrew", "outfit": "English: She always wears stylish outfits.\n\nTurkish: O her zaman şık kıyafetler giyer.\n\nWord: outfit", "administrative": "English: I work in an administrative role at a large company.\nTurkish: Büyük bir şirkette idari bir pozisyonda çalışıyorum.\nWord: administrative", "intermediate": "Sentence: I am learning English at an intermediate level.\n\nTürkçe çeviri: Orta seviyede İngilizce öğreniyorum. \n\nKelime: learning (öğreniyorum)", "postpone": "English: I have to postpone our meeting because of an unexpected event.\nTurkish: Beklenmedik bir olay nedeniyle buluşmamızı ertelemek zorundayım.\nWord = postpone", "interfere": "English: Please don't interfere while I'm working.\nTurkish: Çalışırken lütfen karışmayın.\nWord: interfere", "occurrence": "Word = occurrence\nEnglish: \"This is a rare occurrence.\"\nTurkish: \"Bu nadir bir olay.\"", "asset": "English: The cat is sleeping.\nTurkish: Kedi uyuyor.\nWord: cat", "synthesis": "English: The scientist conducted a synthesis of various compounds in the lab.\nTurkish: Bilim insanı laboratuvarda çeşitli bileşiklerin sentezini gerçekleştirdi.\nWord = synthesis", "outrage": "English: The outrage among the crowd was palpable.\n\nTurkish: Kalabalık arasında öfke hissedilebilir bir şekildeydi.", "standing": "English: The cat is standing on the table.\nTurkish: Kedi masanın üzerinde duruyor.\nWord: standing", "tolerate": "English: He can tolerate spicy food very well.\nTurkish: O acılı yemeği çok iyi tolere edebilir.\nWord = tolerate", "enforce": "English: The police were called to enforce the new regulations.\nTurkish: Yeni düzenlemeleri uygulamak için polis çağrıldı.\nWord: enforce", "pole": "English: I like to swim in the pool.\nTurkish: Havuzda yüzmeyi seviyorum.\nWord: pool", "agricultural": "English: My father is an agricultural engineer.\nTurkish: Babam bir ziraat mühendisidir.\nWord = agricultural", "likelihood": "English: The likelihood of winning the lottery is very low.\nTurkish: Lotoyu kazanma olasılığı çok düşüktür. \nWord = likelihood", "pathway": "Word: pathway\nEnglish: The pathway through the forest was filled with fallen leaves.\nTurkish: Ormanın içinden geçen patika yapraklarla doluydu.", "territory": "English: The cat is sitting on the table.\nTurkish: Kedi masanın üstünde oturuyor.\nWord = cat", "presume": "English: Can you please presume that I will be able to attend the meeting tomorrow?\nTurkish: Lütfen yarınki toplantıya katılabileceğimi varsayabilir misiniz?\nWord: presume", "passionate": "English: I am a passionate writer who loves to express myself through words.\n\nTurkish: Kelime = tutkulu", "filter": "English: The polluted river water passed through the filter and came out clean.\n\nTurkish: Kirli nehir suyu filtreden geçti ve temiz çıktı.\nWord: filter", "portion": "English: \"I would like a portion of pasta, please.\"\nTurkish: \"Lütfen bir porsiyon makarna istiyorum.\"\nWord: portion", "secondly": "English: I always brush my teeth after breakfast.\nTurkish: Kahvaltıdan sonra her zaman dişlerimi fırçalarım.\nWord: always", "credible": "English: She is always honest and trustworthy, making her a credible source of information.\n\nTurkish: O her zaman dürüst ve güvenilir, bu da onu bilgi kaynağı olarak güvenilir kılıyor.\n\nKelime: recommend", "weaken": "English: The illness weakened his immune system.\nTurkish: Hastalık bağışıklık sistemini zayıflattı.\nWord: weaken", "margin": "Word: margin\nSentence: She wrote her notes in the margin of her textbook.\nTurkish Translation: Ders kitabının kenarına notlarını yazdı.", "concrete": "English: I need to buy some concrete for the construction project.\nTurkish: İnşaat projesi için biraz beton almam gerekiyor.\nWord: concrete", "shed": "English: I have a beautiful garden with a shed.\nTurkish: Çardaklı güzel bir bahçem var.", "accent": "English: Please add a thick layer of cream on top of the cake.\nTurkish: Lütfen pastanın üzerine kalın bir kat krema ekleyin.\nWord = cream", "timber": "Kelime: seashell\n\nİngilizce: I picked up a beautiful seashell on the beach.\n\nTürkçe: Plajda güzel bir deniz kabuğu buldum.", "content2": "English: The weather is sunny.\nTurkish: Hava güneşli.\nWord = weather", "optimism": "English: The word is \"optimism.\"\nTurkish: Kelime \"umut\"tur.", "sometime": "English: Can you please lend me your pen? \nTurkish: Bana lütfen kalemini ödünç verebilir misin?\nWord: lend", "liter": "Word: liter\nSentence: The capacity of the bottle is one liter.\n\nTurkish Translation: Şişenin kapasitesi bir litredir.", "spotlight": "English: The spotlight shone on the lead singer as she performed on stage.\nTurkish: Işık huzmesi, sahnede performans sergileyen baş şarkıcı üzerinde parladı.\nWord = spotlight", "reinforce": "English: The teacher used positive reinforcement to encourage the students to participate in class. \nTurkish: Öğretmen, sınıfta katılımını teşvik etmek için olumlu pekiştirme kullanmıştır.\nword = reinforcement", "essentially": "English: The word \"essentially\" means something in its most basic or fundamental form.\n\nTurkish: \"Essentially\" kelimesi bir şeyin en temel veya esas haliyle ifade ettiğini anlatır.", "chunk": "English: Can you please help me with this task?\nTurkish: Bu görevi benimle yardımcı olur musunuz? \nword = task", "retail": "English: I went to the retail store to buy some new clothes.\nTurkish: Yeni kıyafetler almaya gitmek için perakende mağazasına gittim.\nWord: retail", "moving": "English: The moving train passed by quickly.\n\nTurkish: Hareketli tren hızla geçti.", "mosquito": "English: I am afraid of mosquitoes because they bite.\nTurkish: Sivrisineklerden korkuyorum çünkü ısırırlar. \nKelime: afraid", "recruit": "English: She decided to recruit new employees for her company.\n\nTurkish: Şirketi için yeni çalışanlar işe almak için karar verdi.", "reproduction": "English: Reproduction is the process by which organisms produce offspring. \nTurkish: Üreme, organizmaların yavru üretme sürecidir.\nWord: reproduction", "occasional": "English: I enjoy listening to music on occasional evenings.\nTurkish: Arada bir akşamları müzik dinlemekten keyif alırım.\nWord = occasional", "whereby": "English: \"I enjoy playing soccer with my friends.\"\n\nTurkish: \"Arkadaşlarımla futbol oynamaktan keyif alıyorum.\"\n\nWord: \"enjoy\"", "subsequently": "English: The cat is sleeping on the chair.\nTurkish: Kedi sandalyenin üzerinde uyuyor.\nWord: cat", "implementation": "English: The cat is sleeping on the couch.\nTurkish: Kedi koltukta uyuyor.\nWord: sleeping", "sound": "English: The cat is sleeping.\n\nTurkish: Kedi uyuyor.\nWord: sleeping.", "profound": "English: The ocean is profound and mysterious.\n\nTurkish: Okyanus derindir ve gizemlidir.\n\nWord: mysterious", "supportive": "English: Our teacher is very supportive, she always helps us with our difficulties.\n\nTurkish: Öğretmenimiz çok destekleyici, her zaman zorluklarımızla bize yardımcı olur.\n\nWord: supportive", "dependent": "English: I am dependent on my family for financial support.\nTurkish: Ailemden maddi destek için bağımlıyım.\nWord: dependent", "neglect": "English: She neglects her responsibilities at work.\n\nTurkish: İşte sorumluluklarını ihmal ediyor.", "restore": "English: I need to restore my old laptop to its factory settings.\nTurkish: Eski dizüstü bilgisayarımı fabrika ayarlarına geri yüklemem gerekiyor.\nWord: restore", "headquarters": "English: The company's headquarters are located in London.\n\nTurkish: Şirketin merkezi Londra'da bulunmaktadır.\nWord: Headquarters", "troop": "English: The troop of soldiers marched in formation.\nTurkish: Askerlerin birliği düzende yürüdü.\nWord: troop", "superintendent": "English: The superintendent is responsible for managing the day-to-day operations of the building.\n\nTurkish: Müdür, binanın günlük işleyişini yönetmekten sorumludur.", "vacuum": "English: I need to vacuum the entire house before guests arrive.\nTurkish: Misafirler gelmeden önce tüm evi süpürmek zorundayım.\nKelime = süpürmek", "ambitious": "English: He has ambitious goals for his career.\nTurkish: Kariyeri için iddialı hedefleri var.\nWord: ambitious", "solely": "English: I enjoy reading solely for pleasure.\nTurkish: Sadece zevk için okumayı keyif alıyorum.\nWord: pleasure", "soak": "English: I enjoy soaking in a hot bath after a long day.\nTurkish: Uzun bir günün ardından sıcak bir banyoda suya girerek keyif alıyorum.\nWord = soak", "undergraduate": "English: He is an undergraduate student at the university.\nTurkish: O, üniversitede bir lisans öğrencisi.", "partnership": "English: I believe that partnership is crucial for success in business.\n\nTurkish: İşte başarı için ortaklık çok önemli olduğuna inanıyorum.\nWord = success", "adaptation": "English: My favorite book is an adaptation of a classic novel.\n\nTurkish: En sevdiğim kitap, bir klasik romana uyarlanmış bir yapımdır.\n\nWord: adaptation", "obstacle": "English: I encountered an obstacle while running the race.\nTurkish: Yarışı koşarken bir engelle karşılaştım.\nWord: obstacle", "adjust": "English: The engineer needs to adjust the settings for optimal performance.\nTurkish: Mühendis, en iyi performans için ayarları düzenlemeli. \nWord: adjust", "defy": "English: He decided to defy the rules and follow his own path.\nTurkish: Kurallara meydan okumaya ve kendi yolunu izlemeye karar verdi.\nWord: defy", "forbid": "English: I will forbid you from going out tonight.\nTurkish: Bu gece dışarı çıkmanı yasaklayacağım.\nWord = forbid", "kit": "Word: kit\n\nEnglish: I bought a new kit for my painting hobby.\n\nTurkish: Boyama hobim için yeni bir kiti satın aldım.", "info": "Word: info\nEnglish: Can you give me some information about the new project?\nTurkish: Yeni proje hakkında bana biraz bilgi verebilir misiniz?", "dictate": "English: The book I am reading is very interesting.\nTurkish: Okuduğum kitap çok ilginç.\nWord: book", "collaborate": "English: Can you collaborate with me on this project?\nTurkish: Bu projede benimle işbirliği yapabilir misin?\nWord = collaborate", "conserve": "English: Conserve\nSentence: It is important to conserve water in order to protect our planet.\nTurkish: Gezegenimizi korumak için suyu korumak önemlidir.\nKelime = conserve", "coincidence": "English: My friend and I had a pleasant coincidence at the airport yesterday.\n\nTurkish: Dün havaalanında arkadaşım ve ben hoş bir tesadüf yaşadık.\nKelime = tesadüf", "nominate": "English: \"She decided to nominate him as the team captain.\"\nTurkish: \"O, onu takım kaptanı olarak aday göstermeye karar verdi.\"\nWord = nominate", "commissioner": "English: The commissioner is responsible for overseeing the implementation of new policies.\n\nTurkish: Komiser, yeni politikaların uygulanmasını denetlemekten sorumludur.\nWord = commissioner", "diplomatic": "English: The diplomat successfully negotiated a peace treaty between the two countries.\nTurkish: Diplomat, iki ülke arasında başarıyla bir barış antlaşması müzakere etti.", "invasion": "English: The invasion of foreign troops caused panic among the local population.\nTurkish: Yabancı askerlerin istilası yerel halk arasında panik yarattı.\nWord: invasion", "patience": "English: \"I have a lot of patience when it comes to learning new languages.\"\n\nTurkish: \"Yeni diller öğrenme konusunda çok sabrım var.\"\n\nWord: Languages", "governance": "English: The government plays a crucial role in maintaining social order and providing essential services to its citizens.\n\nTurkish: Hükümet, toplumsal düzenin sağlanmasında ve vatandaşlarına temel hizmetlerin sunulmasında kilit bir rol oynar.", "classify": "English: I need to classify these documents based on their content.\nTurkish: Bu belgeleri içeriklerine göre sınıflandırmam gerekiyor.\nWord = classify", "terminate": "English: The teacher asked the students to terminate their work.\n\nTurkish: Öğretmen öğrencilerden çalışmalarını sonlandırmalarını istedi.\n\nWord: terminate", "carbon": "English: \"The cat is sleeping peacefully on the sofa.\"\nTurkish: \"Kedi, koltukta huzurlu bir şekilde uyuyor.\"\nWord: cat", "top": "Word: top\nSentence: I love playing basketball and I always try to be the top scorer in my team.\n\nTurkish Translation: Basketbol oynamayı çok seviyorum ve her zaman takımımda en üst sıradaki skorcu olmaya çalışıyorum.", "spite": "English: The cat scratched me out of spite.\nTurkish: Kedi bana kininden dolayı tırmaladı.\nWord = spite", "pension": "English: My grandmother receives a pension from the government.\n\nTurkish: Büyükannem, hükümetten emekli maaşı alıyor.\n\nWord: pension", "mobile": "English: I have a mobile phone.\nTurkish: Bir cep telefonum var.", "rip": "English: The wind ripped through the trees during the storm.\nTurkish: Fırtına sırasında rüzgar ağaçların arasından geçip yırtıldı.\nWord: rip", "premise": "English: The premise behind this project is to improve education.\nTurkish: Bu projeyle ilgili öncül, eğitimi geliştirmektir.\nKelime = premise", "voting": "English: The voting process for the election went smoothly.\n\nTurkish: Seçim için oy verme süreci sorunsuz bir şekilde ilerledi.\nWord = voting", "hazard": "English: I encountered a hazard while driving on the highway.\n\nTurkish: Otoyolda araba kullanırken bir tehlike ile karşılaştım.\nKelime: hazard", "envelope": "English: The cat is sleeping on the mat.\nTurkish: Kedi, minderin üzerinde uyuyor.\nKelime = cat", "protocol": "English: I will use a translation app to convert this sentence into Turkish.\nTurkish: Bu cümleyi Türkçeye çevirmek için bir çeviri uygulaması kullanacağım.\nWord: Convert", "presumably": "English: The cat is sleeping on the couch.\nTurkish: Kedi koltukta uyuyor.\nWord = couch", "detain": "English: The police detain the suspect for questioning.\nTurkish: Polis, şüpheliyi sorgulama amacıyla gözaltına alır.\nWord = detain", "allege": "English: I allege that he is guilty.\nTurkish: O'nun suçlu olduğunu iddia ediyorum.\nWord: allege", "suspicion": "English: My suspicion is that she is hiding something.\nTurkish: Kuşkum onun bir şeyler sakladığı yönünde. \nKelime = suspicion", "liberal": "English: I am a liberal person who believes in freedom and equality.\nTurkish: Özgürlük ve eşitliğe inanan liberal bir kişiyim.", "judicial": "English: The judicial system plays a crucial role in upholding justice.\n\nTurkish: Yargı sistemi adaletin korunmasında kritik bir rol oynar.\n\nWord: technology", "neously": "English: The cat is sleeping peacefully.\nTurkish: Kedi huzurlu bir şekilde uyuyor.\nWord = peacefully", "tap": "English: The cat is sleeping on the couch.\nTurkish: Kedi koltukta uyuyor.\nWord: koltuk (couch)", "triumph": "English: The student's hard work and dedication led to his triumph in the exam.\nTurkish: Öğrencinin yoğun çalışması ve özverisi, sınavda zaferine yol açtı.\nWord: triumph", "mechanic": "English: I need to take my car to the mechanic because it's making strange noises.\n\nTurkish: Arabamı garaja götürmem gerekiyor çünkü tuhaf sesler çıkarıyor.\n\nWord = mechanic", "hardware": "English: The hardware of my computer is outdated.\nTurkish: Bilgisayarımın donanımı eski kalmış. \nWord: computer", "supreme": "English: The Supreme Court is responsible for interpreting the Constitution.\nTurkish: Yüksek Mahkeme Anayasa'yı yorumlamaktan sorumludur.\nWord = Supreme", "hail": "English: It started to hail just as we arrived home.\n\nTurkish: Eve vardığımız gibi dolu yağmaya başladı.\nWord: hail", "bankruptcy": "English: The company declared bankruptcy after several years of financial struggle.\nTurkish: Şirket, mali zorlukların yaşandığı birkaç yılın ardından iflasını ilan etti.\nWord: bankruptcy", "fraction": "English: I need a fraction to solve this math problem.\nTurkish: Bu matematik problemini çözmek için bir kesire ihtiyacım var.\nWord: fraction", "dip": "English: The dog jumped into the river.\n\nTurkish: Köpek, nehire atladı.\nKelime: köpek (dog)", "miner": "English: The miner went deep into the tunnel to search for gold.\nTurkish: Madenci altına ulaşmak için tünele derinlere gitti.\nWord = miner", "toxic": "English: Toxic substances can be harmful to both humans and the environment.\n\nTurkish: Toksik maddeler hem insanlara hem de çevreye zararlı olabilir.\nword = substances", "explicitly": "English: The dog is barking loudly.\nTurkish: Köpek yüksek sesle havlıyor.\nWord = barking", "perceive": "English: Perception is the way we interpret and understand the world around us.\nTurkish: Algı, etrafımızdaki dünyayı yorumlama ve anlama şeklimizdir.", "injection": "English: I need an injection because I am feeling sick.\nTurkish: Hasta olduğum için bir iğneye ihtiyacım var.\nWord: injection", "vicious": "English: He has a vicious temper.\n\nTurkish: Onun hırçın bir mizacı var.\nWord = vicious", "favorable": "English: I find the weather today very favorable for a picnic.\n\nTurkish: Bugün hava çok uygun olduğu için piknik yapmak için çok elverişli buluyorum.\n\nWord: suitable", "thumb": "English: \"I always use my thumb to scroll through social media feeds.\"\nTurkish: \"Sosyal medya akışlarında dolaşmak için her zaman başparmağımı kullanırım.\"\nWord: thumb", "dynamic": "English: I like to listen to dynamic music while I work.\n\nTurkish: İş yaparken dinamik müzik dinlemeyi seviyorum.\n\nWord: enjoy", "supervisor": "English: My supervisor helps me with my work at the office.\nTurkish: Ofisimdeki yöneticim benim işimle bana yardımcı olur.\nWord = supervisor", "relieve": "English: After a long day at work, yoga helps me relieve stress.\nTurkish: İşten uzun bir günün ardından, yoga stresimi hafifletmeme yardımcı oluyor.\nWord = relieve", "cheek": "English: She touched her cheek gently.\n\nTurkish: Nazikçe yanaklarını okşadı.\n\nWord = cheek", "warming": "English: The sun provides warmth on a cold winter day.\nTurkish: Güneş, soğuk bir kış gününde sıcaklık sağlar. \nWord = warmth", "readily": "English: I am readily available to help with any tasks.\nTurkish: Herhangi bir göreve yardımcı olmak için hazırım.\nWord: available", "embed": "Word: embed\n\nEnglish: The video was embedded in the website for easy viewing.\n\nTurkish: Video, kolay izlenmesi için web sitesine gömülü olarak yerleştirildi.", "foster": "English: She decided to foster a stray cat that she found on the street.\nTurkish: O sokakta bulduğu bir sokak kedisi bakmaya karar verdi.\nWord: foster", "recount": "English: Can you please recount the number of cards we have?\nTurkish: Lütfen sahip olduğumuz kartların sayısını yeniden sayabilir misiniz?\nWord = recount", "humanity": "English: Humanity is capable of achieving great things when united.\n\nTurkish: İnsanlık, birleştiğinde büyük şeylere ulaşabilecek bir potansiyele sahiptir.\n\nWord: capability", "counselor": "English: The counselor helps students with their academic and personal problems.\nTurkish: Rehber öğretmen, öğrencilere akademik ve kişisel problemleri konusunda yardımcı olur.\nWord = counselor", "crack": "English: Can you hand me the crack pipe?\nTurkish: Çatlak boruyu bana uzatabilir misin?\nWord: crack", "cemetery": "English: My grandfather is buried in the cemetery.\nTurkish: Dedem mezarlıkta gömülü.", "creep": "English: I felt a creep down my spine when I saw the ghost.\nTurkish: Korktuğumda, hayaleti gördüğümde sırtımda bir ürperti hissettim.\nWord = creep", "innovative": "English: The company's innovative approach to problem-solving catapulted it to the top of the industry.\n\nTurkish: Şirketin sorun çözme konusundaki yenilikçi yaklaşımı, onu endüstrinin zirvesine taşıdı.\n\nWord: innovative", "ironic": "English: The weather is ironic today, it was sunny in the morning but now it's raining.\n\nTurkish: Bugün hava ironiktir, sabah güneşliydi ama şimdi yağmur yağıyor.\nWord = ironic", "simulation": "English: I enjoy playing simulation games on my computer.\n\nTurkish: Bilgisayarımda simulasyon oyunları oynamaktan keyif alıyorum.", "laser": "English: I need to buy a new laser printer for my office. \n\nTurkish: Ofisim için yeni bir lazer yazıcı satın almam gerekiyor. \n\nWord: printer", "grace": "English: The child danced with grace.\n\nTurkish: Çocuk zarifçe dans etti.", "compulsory": "English: I have a compulsory meeting tomorrow.\nTurkish: Yarın zorunlu bir toplantım var.\nWord: compulsory", "asylum": "English: She sought asylum in a foreign country.\nTurkish: Yabancı bir ülkede iltica talebinde bulundu.\nWord = asylum", "copper": "Kelime: copper\nİngilizce cümle: The Statue of Liberty is made of copper.\nTürkçe çeviri: Özgürlük Heykeli, bakırdan yapılmıştır.", "rehabilitation": "English: My sister is currently receiving rehabilitation after her ankle surgery.\nTurkish: Kız kardeşim şu anda ayak bileği ameliyatı sonrası rehabilitasyon görüyor.\nWord: ankle", "discard": "English: Please discard the old newspapers.\nTurkish: Eski gazeteleri çöpe atınız.\nWord = discard", "decision-making": "English: I need to make a decision about which university to attend.\n\nTurkish: Hangi üniversiteye gideceğim konusunda bir karar vermem gerekiyor.\nWord = decision-making", "visa": "English: I need to renew my visa before it expires.\n\nTurkish: Vizenin süresi dolmadan önce yenilemem gerekiyor.", "invoke": "English: She invoked the ancient spirits during the ritual.\nTurkish: Tören sırasında o, eski ruhları çağırdı.\nWord: invoke", "documentation": "Word = documentation\n\nEnglish sentence: I need to gather all the documentation before submitting my report.\nTurkish translation: Raporumu sunmadan önce tüm belgeleri toplamam gerekiyor.", "acceptance": "English: I need to practice my English every day.\n\nTurkish: Her gün İngilizcem'i pratik yapmam lazım.\n\nWord: practice", "coverage": "English: Could you give me the coverage report for the project?\n\nTurkish: Proje için bana kapsama raporunu verebilir misiniz?\n\nWord: coverage", "seemingly": "English: The storm seemed never-ending.\n\nTurkish: Fırtına görünüşe göre hiç bitmeyecek gibi görünüyordu.\nword = never-ending", "aspiration": "English: My aspiration is to become a successful writer.\nTurkish: Hedefim başarılı bir yazar olmak. \nWord = aspiration", "cliff": "English: He stood at the edge of the cliff, admiring the breathtaking view.\n\nTurkish: O, nefes kesici manzarayı hayranlıkla izlerken, uçurumun kenarında durdu. \nKelime = admire", "transmission": "English: Can you please write a sentence using the word \"transmission\"?\nTurkish: Lütfen \"transmission\" kelimesini kullanarak bir cümle yazar mısınız?", "genuine": "English: He always speaks genuine words.\nTurkish: O her zaman samimi sözler söyler.\nWord: genuine", "crawl": "English: The baby is learning to crawl.\nTurkish: Bebek emeklemeyi öğreniyor.\nWord: crawl", "align": "English: Please align the text to the left side of the page.\nTurkish: Lütfen metni sayfanın sol kenarına hizalayın.\nword = align", "divert": "English: The children like to divert themselves by playing games.\nTurkish: Çocuklar oyun oynayarak kendilerini eğlendirmeği severler.\nWord: divert", "patrol": "English: I need to buy some groceries from the store.\nTurkish: Marketten bazı alışveriş yapmam gerekiyor.\nWord = groceries", "mode": "English: Can you please lend me your pen?\nTurkish: Bana lütfen kalemini ödünç verebilir misin?\nWord: lend", "confront": "English: I had to confront my fears in order to move forward in my life.\nTurkish: Hayatımda ilerlemek için korkularımla yüzleşmek zorunda kaldım.\nWord = confront", "enrich": "English: We need to enrich our vocabulary in order to improve our language skills.\nTurkish: Dil becerilerimizi geliştirmek için kelime dağarcığımızı zenginleştirmemiz gerekiyor.\nWord = enrich", "revival": "English: The revival of this traditional dance form has brought joy to the entire community.\n\nTurkish: Bu geleneksel dans formunun yeniden canlanması, tüm topluma sevinç getirdi. \n\nWord: revival", "embark": "English: I decided to embark on a new adventure and travel the world.\nTurkish: Yeni bir maceraya atılmak ve dünyayı gezmek konusunda karar verdim.\nWord: embark", "hook": "English: I love to read books.\nTurkish: Ben kitap okumayı çok seviyorum.\nWord = books", "referendum": "English: \"The citizens voted in the referendum to determine the future of the country.\"\n\nTurkish: \"Vatandaşlar ülkenin geleceğini belirlemek için referanduma oy kullandı.\"", "buddy": "English: The cat is sleeping peacefully on the couch.\n\nTurkish: Kedi kanepe üzerinde huzurlu bir şekilde uyuyor.\nWord: cat", "historian": "English: The historian is researching ancient civilizations.\nTurkish: Tarihçi antik medeniyetleri araştırıyor.\nWord: historian", "counseling": "English: My sister is studying counseling at university.\n\nTurkish: Kız kardeşim üniversitede danışmanlık okuyor.\nWord = counseling", "notebook": "Word: cat\n\nEnglish: The cat is sleeping on the sofa.\n\nTurkish: Kedi koltukta uyuyor.", "destruction": "English: The hurricane caused widespread destruction in the coastal cities.\nTurkish: Kasırga, kıyı şehirlerinde geniş çapta yıkıma neden oldu.\nWord: destruction", "indication": "English: The weather today is very hot.\nTurkish: Bugün hava çok sıcak.\nWord= weather", "rose": "English: The rose smells wonderful.\nTurkish: Gül harika kokar.\nWord: smell", "compound": "English: I always take notes during my classes because my teacher encourages us to have a compound study habit.\n\nTurkish: Öğretmenim bize bileşik bir çalışma alışkanlığı edinmemizi teşvik ettiği için derslerim sırasında her zaman notlar alırım.\n\nWord: encourage", "unconstitutional": "English: The government's actions are unconstitutional.\nTurkish: Hükümetin eylemleri anayasaya aykırıdır.\nWord: unconstitutional", "revelation": "English: \"The cat is sleeping on the couch.\"\n\nTurkish: \"Kedi kanepede uyuyor.\"\n\nWord: cat", "unfortunate": "English: She had an unfortunate accident on her way to work.\n\nTurkish: İşe giderken talihsiz bir kaza geçirdi.\n\nWord: difficult", "dime": "Word: dime\nEnglish Sentence: I found a dime on the street.\nTurkish Translation: Sokakta bir on cent buldum.", "foreigner": "Kelime: foreigner\nCümle: My friend is a foreigner and he is learning Turkish.\nTürkçe çeviri: Arkadaşım bir yabancı ve o Türkçe öğreniyor.", "remains": "English: The cat remains on the table.\nTurkish: Kedi masanın üzerinde kalır.\nWord: remains", "monument": "Word: Monument\nEnglish: The Eiffel Tower is a famous monument in Paris.\nTurkish: Eyfel Kulesi, Paris'te ünlü bir anıttır.", "passive": "English: The students were asked to complete a passive exercise in the English class.\nTurkish: Öğrencilere İngilizce dersinde pasif hali tamamlamaları için bir egzersiz yapıldı.\nWord = exercise"}